_G.t_banbenlist = {
     [1] = {
          ['id'] = 1,
          ['Name'] = "龙腾团队",
          ['Func'] = "200.0",
          },

     [2] = {
          ['id'] = 2,
          ['Name'] = "将军团队",
          ['Func'] = "300.0",
          },

     [3] = {
          ['id'] = 3,
          ['Name'] = "幸运草团队",
          ['Func'] = "300.0",
          },

     [4] = {
          ['id'] = 4,
          ['Name'] = "绿源团队",
          ['Func'] = "300.0",
          },

     [5] = {
          ['id'] = 5,
          ['Name'] = "老酒馆团队",
          ['Func'] = "300.0",
          },

     [6] = {
          ['id'] = 6,
          ['Name'] = "辉煌团队",
          ['Func'] = "300.0",
          },

     [7] = {
          ['id'] = 7,
          ['Name'] = "丰收树团队",
          ['Func'] = "300.0",
          },

}